[
  {
    "doa": "Doa Sebelum Makan",
    "ayat": "اللّهُـمَّ بارِكْ لَنا فيما رَزَقْتَنا وَقِنا عَذَابَ النّارِ",
    "latin": "Allahumma barik lana fima razaqtana wa qina 'adhaban-nar",
    "artinya": "Ya Allah, berkahilah kami dalam apa yang telah Engkau karuniakan kepada kami, dan jauhkanlah kami dari siksa api neraka."
  },
  {
    "doa": "Doa Setelah Makan",
    "ayat": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مِنَ الْمُسْلِمِينَ",
    "latin": "Alhamdulillahil ladzi ath’amana wa saqana wa ja’alana minal muslimin",
    "artinya": "Segala puji bagi Allah yang telah memberi kami makan dan minum serta menjadikan kami termasuk orang-orang yang berserah diri."
  },
  {
    "doa": "Doa Sebelum Tidur",
    "ayat": "بِاسْمِكَ اللّهُمَّ أَحْيَا وَبِاسْمِكَ أَمُوتُ",
    "latin": "Bismika Allahumma ahya wa bismika amut",
    "artinya": "Dengan nama-Mu, ya Allah, aku hidup dan dengan nama-Mu aku mati."
  },
  {
    "doa": "Doa Bangun Tidur",
    "ayat": "الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
    "latin": "Alhamdulillahil ladzi ahyana ba'da ma amatana wa ilayhin-nushur",
    "artinya": "Segala puji bagi Allah yang telah menghidupkan kami kembali setelah mematikan kami, dan kepada-Nyalah tempat kembali."
  },
  {
    "doa": "Doa Masuk Kamar Mandi",
    "ayat": "اللّهُـمَّ إِنِّي أَعـوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبائِثِ",
    "latin": "Allahumma inni a'udzu bika minal khubuthi wal khaba'ith",
    "artinya": "Ya Allah, aku berlindung kepada-Mu dari godaan setan laki-laki dan setan perempuan."
  },
  {
    "doa": "Doa Keluar Kamar Mandi",
    "ayat": "غُفْرَانَكَ",
    "latin": "Ghufranak",
    "artinya": "Aku memohon ampunan-Mu, ya Allah."
  },
  {
    "doa": "Doa Ketika Mendengar Petir",
    "ayat": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ مِنْ خِيفَتِهِ",
    "latin": "Subhanalladhi yusabbihur ra'du bihamdihi wal malaikatu min khifatih",
    "artinya": "Mahasuci Allah yang petir bertasbih dengan memuji-Nya, begitu juga para malaikat karena takut kepada-Nya."
  }
]
